oriflame/src/test/resources/real_files/pooi_valtrip_8870115_12102015_145628.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <OUTBOUND_ORDER_ISSUE xmlns="urn:ifsworld-com:schemas:post_outbound_order_issue">
         <CUSTOMER_NO>BUD</CUSTOMER_NO>
         <DELIVERY_DATE>2015-10-12T00:00:00.000+00:00</DELIVERY_DATE>
         <NOTE_ID>8870115</NOTE_ID>
         <SHIPMENT_ID>8870115</SHIPMENT_ID>
         <SHIPPED_DATE>2015-10-12T00:00:00.000+00:00</SHIPPED_DATE>
         <SITE>DCBUD</SITE>
         <TERMS_DELIVERY>FCA Ullo</TERMS_DELIVERY>
         <HEADERS>
            <OUTBOUND_ORDER_ISSUE_HEADER>
               <ADDRESS_LINE_1>ORIFLAME HUNGARY KFT.</ADDRESS_LINE_1>
               <ADDRESS_LINE_2>Magyar Posta Zrt. OLK</ADDRESS_LINE_2>
               <ADDRESS_LINE_3>Gervay Mihaly u. 9-11</ADDRESS_LINE_3>
               <CITY>Budaors</CITY>
               <CO_ORDER_TYPE>CONSULTANT_ORDERS</CO_ORDER_TYPE>
               <COUNTRY>HU</COUNTRY>
               <CRT_QTY>456.0</CRT_QTY>
               <CURRENCY>HUF</CURRENCY>
               <DELIVERY_COST>0.00</DELIVERY_COST>
               <DESTINATION_ID>90</DESTINATION_ID>
               <GROSS_WEIGHT>1277.31</GROSS_WEIGHT>
               <INVOICE_NO>U115102</INVOICE_NO>
               <OUTBOUND_COMPLETE>0</OUTBOUND_COMPLETE>
               <PALLET_COST>0.00</PALLET_COST>
               <PALLET_QTY>4.0</PALLET_QTY>
               <PALLET_WEIGHT>60.0</PALLET_WEIGHT>
               <SHIP_VIA_CODE>G</SHIP_VIA_CODE>
               <SOURCE_WAREHOUSE_ID>DCBUD</SOURCE_WAREHOUSE_ID>
               <ZIP_CODE>2040</ZIP_CODE>
               <PALLETS>
                  <OUTBOUND_ORDER_ISSUE_PALLET>
                     <BPP>121.0</BPP>
                     <PALLET_ID>O760367</PALLET_ID>
                     <UPP>2229.0</UPP>
                     <LINES>
                        <OUTBOUND_ORDER_ISSUE_LINE>
                           <BOX_ID>0013366922</BOX_ID>
                           <COUNTRY_OF_ORIGIN>BE</COUNTRY_OF_ORIGIN>
                           <CUSTOMS_STAT_NO>330499000000</CUSTOMS_STAT_NO>
                           <LINE_NO>6</LINE_NO>
                           <LOCATION_NO>P</LOCATION_NO>
                           <NET_WEIGHT>0.075</NET_WEIGHT>
                           <PART_NO>24328.1</PART_NO>
                           <QUANTITY>1.0</QUANTITY>
                           <UNIT_PRICE>635.02</UNIT_PRICE>
                        </OUTBOUND_ORDER_ISSUE_LINE>
                        <OUTBOUND_ORDER_ISSUE_LINE>
                           <BOX_ID>0013360225</BOX_ID>
                           <COUNTRY_OF_ORIGIN>CH</COUNTRY_OF_ORIGIN>
                           <CUSTOMS_STAT_NO>330420000000</CUSTOMS_STAT_NO>
                           <LINE_NO>10</LINE_NO>
                           <LOCATION_NO>P</LOCATION_NO>
                           <NET_WEIGHT>0.004</NET_WEIGHT>
                           <PART_NO>31557.1</PART_NO>
                           <QUANTITY>1.0</QUANTITY>
                           <UNIT_PRICE>130.77</UNIT_PRICE>
                        </OUTBOUND_ORDER_ISSUE_LINE>
                        <OUTBOUND_ORDER_ISSUE_LINE>
                           <BOX_ID>0013360225</BOX_ID>
                           <COUNTRY_OF_ORIGIN>CH</COUNTRY_OF_ORIGIN>
                           <CUSTOMS_STAT_NO>330420000000</CUSTOMS_STAT_NO>
                           <LINE_NO>11</LINE_NO>
                           <LOCATION_NO>P</LOCATION_NO>
                           <NET_WEIGHT>0.004</NET_WEIGHT>
                           <PART_NO>31558.1</PART_NO>
                           <QUANTITY>1.0</QUANTITY>
                           <UNIT_PRICE>130.77</UNIT_PRICE>
                        </OUTBOUND_ORDER_ISSUE_LINE>
                        <OUTBOUND_ORDER_ISSUE_LINE>
                           <BOX_ID>0013360225</BOX_ID>
                           <COUNTRY_OF_ORIGIN>CH</COUNTRY_OF_ORIGIN>
                           <CUSTOMS_STAT_NO>330420000000</CUSTOMS_STAT_NO>
                           <LINE_NO>12</LINE_NO>
                           <LOCATION_NO>P</LOCATION_NO>
                           <NET_WEIGHT>0.009</NET_WEIGHT>
                           <PART_NO>31789.1</PART_NO>
                           <QUANTITY>2.0</QUANTITY>
                           <UNIT_PRICE>130.77</UNIT_PRICE>
                        </OUTBOUND_ORDER_ISSUE_LINE>
                        <OUTBOUND_ORDER_ISSUE_LINE>
                           <BOX_ID>0013359075</BOX_ID>
                           <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                           <CUSTOMS_STAT_NO>330410000000</CUSTOMS_STAT_NO>
                           <LINE_NO>22</LINE_NO>
                           <LOCATION_NO>P</LOCATION_NO>
                           <NET_WEIGHT>0.04</NET_WEIGHT>
                           <PART_NO>31942.1</PART_NO>
                           <QUANTITY>1.0</QUANTITY>
                           <UNIT_PRICE>489.80</UNIT_PRICE>
                        </OUTBOUND_ORDER_ISSUE_LINE>
                        <OUTBOUND_ORDER_ISSUE_LINE>
                           <BOX_ID>0013367074</BOX_ID>
                           <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                           <CUSTOMS_STAT_NO>330410000000</CUSTOMS_STAT_NO>
                           <LINE_NO>29</LINE_NO>
                           <LOCATION_NO>P</LOCATION_NO>
                           <NET_WEIGHT>0.04</NET_WEIGHT>
                           <PART_NO>31942.1</PART_NO>
                           <QUANTITY>1.0</QUANTITY>
                           <UNIT_PRICE>489.80</UNIT_PRICE>
                        </OUTBOUND_ORDER_ISSUE_LINE>
                        <OUTBOUND_ORDER_ISSUE_LINE>
                           <BOX_ID>0013360324</BOX_ID>
                           <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                           <CUSTOMS_STAT_NO>330420000000</CUSTOMS_STAT_NO>
                           <LINE_NO>10</LINE_NO>
                           <LOCATION_NO>P</LOCATION_NO>
                           <NET_WEIGHT>0.01</NET_WEIGHT>
                           <PART_NO>31404.1</PART_NO>
                           <QUANTITY>1.0</QUANTITY>
                           <UNIT_PRICE>151.52</UNIT_PRICE>
                        </OUTBOUND_ORDER_ISSUE_LINE>
                     </LINES>
                  </OUTBOUND_ORDER_ISSUE_PALLET>
                  <OUTBOUND_ORDER_ISSUE_PALLET>
                     <BPP>66.0</BPP>
                     <PALLET_ID>O760368</PALLET_ID>
                     <UPP>1149.0</UPP>
                     <LINES>
                        <OUTBOUND_ORDER_ISSUE_LINE>
                           <BOX_ID>0013369505</BOX_ID>
                           <COUNTRY_OF_ORIGIN>CH</COUNTRY_OF_ORIGIN>
                           <CUSTOMS_STAT_NO>330410000000</CUSTOMS_STAT_NO>
                           <LINE_NO>7</LINE_NO>
                           <LOCATION_NO>P</LOCATION_NO>
                           <NET_WEIGHT>0.011</NET_WEIGHT>
                           <PART_NO>31442.1</PART_NO>
                           <QUANTITY>1.0</QUANTITY>
                           <UNIT_PRICE>226.69</UNIT_PRICE>
                        </OUTBOUND_ORDER_ISSUE_LINE>
                        <OUTBOUND_ORDER_ISSUE_LINE>
                           <BOX_ID>0013369562</BOX_ID>
                           <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                           <CUSTOMS_STAT_NO>330420000000</CUSTOMS_STAT_NO>
                           <LINE_NO>1</LINE_NO>
                           <LOCATION_NO>P</LOCATION_NO>
                           <NET_WEIGHT>0.013</NET_WEIGHT>
                           <PART_NO>26820.1</PART_NO>
                           <QUANTITY>1.0</QUANTITY>
                           <UNIT_PRICE>176.00</UNIT_PRICE>
                        </OUTBOUND_ORDER_ISSUE_LINE>
                        <OUTBOUND_ORDER_ISSUE_LINE>
                           <BOX_ID>0013369597</BOX_ID>
                           <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                           <CUSTOMS_STAT_NO>330420000000</CUSTOMS_STAT_NO>
                           <LINE_NO>12</LINE_NO>
                           <LOCATION_NO>P</LOCATION_NO>
                           <NET_WEIGHT>0.014</NET_WEIGHT>
                           <PART_NO>26821.1</PART_NO>
                           <QUANTITY>1.0</QUANTITY>
                           <UNIT_PRICE>176.00</UNIT_PRICE>
                        </OUTBOUND_ORDER_ISSUE_LINE>
                        <OUTBOUND_ORDER_ISSUE_LINE>
                           <BOX_ID>0013369518</BOX_ID>
                           <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                           <CUSTOMS_STAT_NO>330420000000</CUSTOMS_STAT_NO>
                           <LINE_NO>12</LINE_NO>
                           <LOCATION_NO>P</LOCATION_NO>
                           <NET_WEIGHT>0.015</NET_WEIGHT>
                           <PART_NO>26819.1</PART_NO>
                           <QUANTITY>1.0</QUANTITY>
                           <UNIT_PRICE>176.00</UNIT_PRICE>
                        </OUTBOUND_ORDER_ISSUE_LINE>
                        <OUTBOUND_ORDER_ISSUE_LINE>
                           <BOX_ID>0013369478</BOX_ID>
                           <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                           <CUSTOMS_STAT_NO>330420000000</CUSTOMS_STAT_NO>
                           <LINE_NO>14</LINE_NO>
                           <LOCATION_NO>P</LOCATION_NO>
                           <NET_WEIGHT>0.01</NET_WEIGHT>
                           <PART_NO>31402.1</PART_NO>
                           <QUANTITY>1.0</QUANTITY>
                           <UNIT_PRICE>151.52</UNIT_PRICE>
                        </OUTBOUND_ORDER_ISSUE_LINE>
                        <OUTBOUND_ORDER_ISSUE_LINE>
                           <BOX_ID>0013369459</BOX_ID>
                           <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                           <CUSTOMS_STAT_NO>330420000000</CUSTOMS_STAT_NO>
                           <LINE_NO>16</LINE_NO>
                           <LOCATION_NO>P</LOCATION_NO>
                           <NET_WEIGHT>0.015</NET_WEIGHT>
                           <PART_NO>26819.1</PART_NO>
                           <QUANTITY>1.0</QUANTITY>
                           <UNIT_PRICE>176.00</UNIT_PRICE>
                        </OUTBOUND_ORDER_ISSUE_LINE>
                     </LINES>
                  </OUTBOUND_ORDER_ISSUE_PALLET>
               </PALLETS>
            </OUTBOUND_ORDER_ISSUE_HEADER>
         </HEADERS>
      </OUTBOUND_ORDER_ISSUE>
   </soap:Body>
</soap:Envelope>